app/Controllers/HomepageController.php

SELECT *
FROM `berita`
---
    public function index()
    {
        $data = [
            'berita_1' => $this->berita->getFirstBerita(),
            'berita_2' => $this->berita->getSecondBerita(),
            'berita_3' => $this->berita->getThirdsBerita(),
            'berita' => $this->berita->findAll(),