app/Controllers/LaporanController.php

    public function index($id_waris = null)
    {
        $data =array();
        $data = ([
            's_tidak_mampu'   => $this->s_tidak_mampu->findAll(),
            's_pengantar'     => $this->s_pengantar->findAll(),
            's_domisili'  => $this->s_domisili->findAll(),
            's_keterangan'  => $this->s_keterangan->findAll(),
            's_kematian'    => $this->s_kematian->findAll(),
            's_waris'       => $this->s_waris->getData()->getResultArray(),
            'data_waris'   => $this->s_waris->findAll(),
        ]);
---
SELECT *
FROM `tb_s_tidak_mampu`
SELECT *
FROM `tb_s_pengantar`
SELECT *
FROM `tb_s_domisili`
SELECT *
FROM `tb_s_kematian`
SELECT *
FROM `tb_s_waris`