app/Controllers/SDomisiliController.php

SELECT *
FROM `tb_s_domisili`
WHERE `tb_s_domisili`.`id` = '6'
SELECT *
FROM `tb_warga`
WHERE `tb_warga`.`nik` = '3577024801020003'
---
    public function edit($id = null)
    {
        // ambil artikel yang akan diedit
        $surat_domisili = $this->s_domisili;
        // $data['produks'] = $produk->where('id_produk', $id)->first();
        $data_warga = $this->warga;
        $result = $surat_domisili->find($id);
        $nik = $result['nik'];
        // $wrg = $data_warga->find($nik);
        // dd($wrg);
        $data = ([
            's_domisili'   => $result,
            'warga'         => $data_warga->find($nik),

SELECT *
FROM `tb_warga`
WHERE `tb_warga`.`nik` = '3577024801020003'
UPDATE `tb_s_domisili` SET `nik` = '3577024801020003', `jenis_surat` = 'Surat Keterangan Domisili', `keperluan` = 'suket domisili', `pengambilan` = 'email', `status` = 'proses'
WHERE `tb_s_domisili`.`id` IN ('6')
UPDATE `tb_warga` SET `tempat_lahir` = 'madiun', `tgl_lahir` = '2024-01-02', `jenis_kelamin` = 'L', `agama` = 'islam', `kewarganegaraan` = 'Indonesia', `status_perkawinan` = 'Lajang', `pekerjaan` = 'Wiraswasta', `alamat` = 'sobrah ', `email` = 'amaliayulianoor240@gmail.com'
WHERE `tb_warga`.`nik` IN ('3577024801020003')
---
    public function update($id = null)
    {
        $surat_domisili = $this->s_domisili;
        $warga = $this->warga;

        $nik = $this->request->getVar('nik');
        $data_warga = $warga->find($nik);
        $id_warga = $data_warga['nik'];
        $data_permohonan = [
            'nik'   => $data_warga['nik'],
            'jenis_surat' => 'Surat Keterangan Domisili',
            'keperluan' => $this->request->getVar('keperluan'),
            'pengambilan' => $this->request->getVar('pengambilan'),
            'status' => 'proses',
            'identitas' => $data_warga['identitas']
        ];

        $data_diri = [
            'tempat_lahir' => $this->request->getVar('tempat_lahir'),
            'tgl_lahir' => $this->request->getVar('tgl_lahir'),
            'jenis_kelamin' => $this->request->getVar('jenis_kelamin'),
            'agama' => $this->request->getVar('agama'),
            'kewarganegaraan' => $this->request->getVar('kewarganegaraan'),
            'status_perkawinan' => $this->request->getVar('status_perkawinan'),
            'pekerjaan' => $this->request->getVar('pekerjaan'),
            'alamat' => $this->request->getVar('alamat'),
            'email' => $this->request->getVar('email'),
        ];

        $surat_domisili->update($id, $data_permohonan);
        $warga->update($id_warga, $data_diri);