app/Controllers/SKematianController.php

SELECT *
FROM `tb_s_kematian`
WHERE `tb_s_kematian`.`id` = '3'
SELECT *
FROM `tb_warga`
WHERE `tb_warga`.`nik` = '3577024802480005'
---
    public function edit($id = null)
    {
        // ambil konten yang akan diedit
        $surat_kematian = $this->s_kematian;
        // $data['produks'] = $produk->where('id_produk', $id)->first();
        $data_warga = $this->warga;
        $result = $surat_kematian->find($id);
        $nik = $result['nik'];
        // $wrg = $data_warga->find($nik);
        // dd($wrg);
        $data = ([
            's_kematian'   => $result,
            'warga'         => $data_warga->find($nik),

SELECT *
FROM `tb_warga`
WHERE `tb_warga`.`nik` = '3577024802480005'
---
    public function update($id = null)
    {
        $surat_kematian = $this->s_kematian;
        $warga = $this->warga;

        $nik = $this->request->getVar('nik');
        $data_warga = $warga->find($nik);

UPDATE `tb_warga` SET `tempat_lahir` = 'madiun', `tgl_lahir` = NULL, `jenis_kelamin` = 'L', `agama` = 'islam', `kewarganegaraan` = 'Indonesiaa', `status_perkawinan` = 'Lajang', `pekerjaan` = 'Pelajar', `alamat` = 'basin', `email` = 'mdeisvianti@gmail.com', `umur` = 0
WHERE `tb_warga`.`nik` IN ('3577024802480005')
---

        // dd($data_kematian);
        $surat_kematian->update($id, $data_kematian);
        $warga->update($id_warga, $data_diri);