app/Controllers/SKeteranganUsahaController.php

SELECT *
FROM `tb_warga`
WHERE `tb_warga`.`nik` = '3577024801025000'
---
    public function edit($id = null)
    {
        // ambil artikel yang akan diedit
        $surat_keterangan = $this->s_keterangan;
        // $data['produks'] = $produk->where('id_produk', $id)->first();
        $data_warga = $this->warga;
        $result = $surat_keterangan->find($id);
        $nik = $result['nik'];
        // $wrg = $data_warga->find($nik);
        // dd($wrg);
        $data = ([
            's_keterangan'   => $result,
            'warga'         => $data_warga->find($nik),

SELECT *
FROM `tb_warga`
WHERE `tb_warga`.`nik` = '3577024801025000'
UPDATE `tb_warga` SET `tempat_lahir` = 'jakarta', `tgl_lahir` = '2024-01-01', `jenis_kelamin` = 'L', `agama` = 'islam', `kewarganegaraan` = 'Indonesia', `status_perkawinan` = 'Lajang', `pekerjaan` = 'pengusaha udang', `alamat` = 'Plawikan', `email` = 'dhanik@gmail.com'
WHERE `tb_warga`.`nik` IN ('3577024801025000')
---
    public function update($id = null)
    {
        $surat_keterangan = $this->s_keterangan;
        $warga = $this->warga;

        $nik = $this->request->getVar('nik');
        $data_warga = $warga->find($nik);
        $id_warga = $data_warga['nik'];
        $data_keterangan = [
            'nik'   => $data_warga['nik'],
            'jenis_surat' => 'Surat Keterangan Usaha',
            'keperluan' => $this->request->getVar('keperluan'),
            'pengambilan' => $this->request->getVar('pengambilan'),
            'status' => 'proses',
            'identitas' => $data_warga['identitas']
        ];

        $data_diri = [
            'tempat_lahir' => $this->request->getVar('tempat_lahir'),
            'tgl_lahir' => $this->request->getVar('tgl_lahir'),
            'jenis_kelamin' => $this->request->getVar('jenis_kelamin'),
            'agama' => $this->request->getVar('agama'),
            'kewarganegaraan' => $this->request->getVar('kewarganegaraan'),
            'status_perkawinan' => $this->request->getVar('status_perkawinan'),
            'pekerjaan' => $this->request->getVar('pekerjaan'),
            'alamat' => $this->request->getVar('alamat'),
            'email' => $this->request->getVar('email'),
        ];

        $surat_keterangan->update($id, $data_keterangan);
        $warga->update($id_warga, $data_diri);