app/Controllers/SPengantarController.php

SELECT *
FROM `tb_s_pengantar`
WHERE `tb_s_pengantar`.`id` = '3'
SELECT *
FROM `tb_warga`
WHERE `tb_warga`.`nik` = '3577024801020001'
---
    public function edit($id = null)
    {
        // ambil artikel yang akan diedit
        $surat_pengantar = $this->s_pengantar;
        // $data['produks'] = $produk->where('id_produk', $id)->first();
        $data_warga = $this->warga;
        $result = $surat_pengantar->find($id);
        $nik = $result['nik'];
        // $wrg = $data_warga->find($nik);
        // dd($wrg);
        $data = ([
            's_pengantar'   => $result,
            'warga'         => $data_warga->find($nik),