app/Controllers/STidakMampuController.php

SELECT *
FROM `tb_s_tidak_mampu`
WHERE `tb_s_tidak_mampu`.`id` = '3'
SELECT *
FROM `tb_warga`
WHERE `tb_warga`.`nik` = '327304520100010050'
---
    public function edit($id = null)
    {
        // ambil artikel yang akan diedit
        $tidak_mampu = $this->s_tidak_mampu;
        $data_warga = $this->warga;
        $result = $tidak_mampu->find($id);
        $nik = $result['nik'];
        $data = ([
            's_tidak_mampu'   => $tidak_mampu->find($id),
            'warga'         => $data_warga->find($nik)
        ]);