app/Controllers/SWarisController.php

    public function edit($id = null)
    {
        // ambil artikel yang akan diedit
        $surat_waris = $this->s_waris;
        // $data['produks'] = $produk->where('id_produk', $id)->first();
        $data_warga = $this->warga;
        $result = $surat_waris->find($id);
        $nik = $result['nik'];
        // $wrg = $data_warga->find($nik);
        // dd($wrg);
        $data = ([
            's_waris'   => $result,
            'warga'         => $data_warga->find($nik),
---
SELECT *
FROM `tb_s_waris`
WHERE `tb_s_waris`.`id` = '6'
SELECT *
FROM `tb_warga`
WHERE `tb_warga`.`nik` = '3577024801020007'

    public function update($id = null)
    {
        $surat_waris = $this->s_waris;
        $warga = $this->warga;

        $nik = $this->request->getVar('nik');
        $nik = $this->request->getVar('nik');
        $data_warga = $warga->find($nik);
---
SELECT *
FROM `tb_warga`
WHERE `tb_warga`.`nik` = '3577024801020007'

        ];

        $surat_waris->update($id, $data_waris);
        $warga->update($id_warga, $data_diri);
---
UPDATE `tb_warga` SET `tempat_lahir` = 'klaten', `tgl_lahir` = '2024-02-01', `jenis_kelamin` = 'L', `agama` = 'buddha', `kewarganegaraan` = 'Indonesia', `status_perkawinan` = 'Menikah', `pekerjaan` = 'pengusaha', `alamat` = 'Plawikan', `email` = 'dhanik@gmail.com'
WHERE `tb_warga`.`nik` IN ('3577024801020007')