app/Models/BeritaModel.php

SELECT *
FROM `berita`
---
    public function getFirstBerita()
    {
        $query =  $this->db->table('berita')->get()->getFirstRow();

SELECT *
FROM `berita`
---
    public function getSecondBerita()
    {
        $query =  $this->db->table('berita')->get();

SELECT *
FROM `berita`
---
    public function getThirdsBerita()
    {
        $query =  $this->db->table('berita')->get();