app/Models/SWarisModel.php

SELECT *
FROM `tb_s_waris`
JOIN `tb_warga` ON `tb_s_waris`.`nik` = `tb_warga`.`nik`
GROUP BY `ns_waris`
---
    public function getData()
    {
        $query =  $this->db->table('tb_s_waris')
        ->join('tb_warga', 'tb_s_waris.nik = tb_warga.nik')
        ->groupBy('ns_waris')
        ->get();